#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/tadyjp/home-IoT/runs/run-iXdeU6EtimjiTcSs

Waiting for the plan to start...

Terraform v1.1.7
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
aws_cloudwatch_log_group.nature_remo_to_dynamo: Refreshing state... [id=/aws/lambda/nature_remo_to_dynamo]
aws_cloudwatch_log_group.lambda_log_group: Refreshing state... [id=/aws/lambda/soracom_button_to_slack]
aws_kinesis_stream.soracom_button: Refreshing state... [id=arn:aws:kinesis:ap-northeast-1:188529565947:stream/soracom-button]
aws_dynamodb_table.nature_remo_sensor: Refreshing state... [id=nature-remo-sensor]
aws_iam_role.lambda_kinesis_execution: Refreshing state... [id=lambda-kinesis-execution]
aws_iam_role.nature_remo_to_dynamo: Refreshing state... [id=nature-remo-to-dynamo]
aws_iam_role_policy_attachment.lambda_kinesis_execution: Refreshing state... [id=lambda-kinesis-execution-20220318035103012700000001]
aws_lambda_function.soracom_button_to_slack: Refreshing state... [id=soracom_button_to_slack]
aws_lambda_event_source_mapping.soracom_button_lambda: Refreshing state... [id=ec065c36-7c11-44b2-a922-c35a6664679f]
aws_lambda_function.nature_remo_to_dynamo: Refreshing state... [id=nature_remo_to_dynamo]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_dynamodb_table.nature_remo_sensor must be replaced
-/+ resource "aws_dynamodb_table" "nature_remo_sensor" {
      ~ arn              = "arn:aws:dynamodb:ap-northeast-1:188529565947:table/nature-remo-sensor" -> (known after apply)
      ~ id               = "nature-remo-sensor" -> (known after apply)
      ~ name             = "nature-remo-sensor" -> "nature-remo-sensor-2" # forces replacement
      ~ read_capacity    = 0 -> (known after apply)
      + stream_arn       = (known after apply)
      - stream_enabled   = false -> null
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      - tags             = {} -> null
      ~ tags_all         = {} -> (known after apply)
      ~ write_capacity   = 0 -> (known after apply)
        # (3 unchanged attributes hidden)


      ~ point_in_time_recovery {
          ~ enabled = false -> (known after apply)
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }

      ~ ttl {
          + attribute_name = (known after apply)
          ~ enabled        = false -> (known after apply)
        }
        # (2 unchanged blocks hidden)
    }

  # aws_kinesis_stream.soracom_button will be updated in-place
  ~ resource "aws_kinesis_stream" "soracom_button" {
        id                        = "arn:aws:kinesis:ap-northeast-1:188529565947:stream/soracom-button"
        name                      = "soracom-button"
      - shard_count               = 1 -> null
        tags                      = {}
        # (6 unchanged attributes hidden)

      ~ stream_mode_details {
          ~ stream_mode = "PROVISIONED" -> "ON_DEMAND"
        }
    }

  # aws_lambda_function.nature_remo_to_dynamo will be updated in-place
  ~ resource "aws_lambda_function" "nature_remo_to_dynamo" {
        id                             = "nature_remo_to_dynamo"
      ~ last_modified                  = "2022-03-21T14:06:34.000+0000" -> (known after apply)
      ~ runtime                        = "nodejs12.x" -> "nodejs14.x"
      ~ source_code_hash               = "FbXvtBf8FDwEZEQMUFnHFHAYE4XAGghFHrUfmDuovfo=" -> "dVk+SJvkem1SXjQI5H2DWNH0MEAiIQS+pk5FAGFBJ9I="
        tags                           = {}
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_lambda_function.soracom_button_to_slack will be updated in-place
  ~ resource "aws_lambda_function" "soracom_button_to_slack" {
        id                             = "soracom_button_to_slack"
      ~ last_modified                  = "2022-03-21T14:06:26.000+0000" -> (known after apply)
      ~ runtime                        = "nodejs12.x" -> "nodejs14.x"
      ~ source_code_hash               = "FbXvtBf8FDwEZEQMUFnHFHAYE4XAGghFHrUfmDuovfo=" -> "Q8+jI9BjKVQLRs/u7Ucv8kr5b/MSzHNXXakMwIZ1hMQ="
        tags                           = {}
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "MAINBOX_BUTTON_IMEI" = (sensitive)
              + "SLACK_URL"           = (sensitive)
              - "mailbox_button_imei" = (sensitive) -> null
              - "slack_url"           = (sensitive) -> null
            }
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.

Changes to Outputs:
  + kinesis_arn = "arn:aws:kinesis:ap-northeast-1:188529565947:stream/soracom-button"
  - kinesis_url = "arn:aws:kinesis:ap-northeast-1:188529565947:stream/soracom-button" -> null

```
</details>
*Pusher: @tadyjp, Action: `pull_request`*